lib/tasks/todo.rake

  task delete_items: :environment do
      Item.where("created_at <= ?", Time.now - 7.days).destroy_all
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 20]]
SELECT "items".* FROM "items" WHERE (created_at <= '2018-10-08 21:16:02.653218') ORDER BY created_at DESC