app/controllers/items_controller.rb

INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "8"], ["user_id", 1], ["created_at", "2018-10-03 18:42:34.260346"], ["updated_at", "2018-10-03 18:42:34.260346"]]
---
  def create
    @item = current_user.items.build(params.require(:item).permit(:name))

    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]
---
  def destroy
    @item = current_user.items.find(params[:id])

    @item.destroy